Analysis.create(
  product_id: 1,
  positive: 77.5,
  neutral: 12.5,
  negative: 10,
  summary: 'この商品は主にその便利さとコストパフォーマンスについて評価されている。多くのレビューが、購入者がリピートしており、特にラベルレスデザインが評価されており、環境への配慮や廃棄の手軽さを強調している。一方で、配達や箱の状態について不満を言及する声も存在し、購入体験に若干の不安要素を残している。全体として、商品のクオリティと便利さが評価される傾向にある。',
  sum_positive: 'この商品については、主にその飲みやすさと大容量に関する意見が多い。特に565mlという量や、ラベルレスのペットボトルが好評で、廃棄の手間が省ける点が高く評価されている。また、玄関先までの配達も好感を持たれており、便利さが際立つ。クーポンやポイント制度の利用によるお得感についても多くの購入者が満足している。',
  sum_negative: '一方で、配達に関連する不満の声も多く見られる。大きくて重い荷物が玄関に届く際のトラブルや、伝票番号の遅れがあったことが指摘されている。また、箱の潰れについて言及され、贈答用には不向きとされている意見も存在する。これらの経験は、商品のクオリティとは別に、流通に関する不満を生じさせている。',
  created_at: '2024-09-15 18:26:05.254119',
  updated_at: '2024-09-15 18:26:05.254119'
)

Analysis.create(
  product_id: 2,
  positive: 63,
  neutral: 24,
  negative: 13,
  summary: '非常時の備蓄から日常使用に至るまで、幅広く利用されている様子が伺える。多くの人々が購入をリピートしており、特にエコ意識の高いラベルレス製品としての評価も高い。しかし、商品の賞味期限についての懸念もあり、時折不満の声が上がるなど、多様な意見が存在している。',
  sum_positive: '高い評価を受けている理由として、飲みやすさや手軽さ、エコフレンドリーな点が挙げられる。特に600mlという容量の魅力や、重さを気にせずに購入できる利便性が評価されており、クーポンやポイントの利用でさらにお得感を感じるユーザーも多い。また、家族で消費する日常使いや災害時の備蓄にと大変重宝されている。',
  sum_negative: '賞味期限の短さに関する不満が多く見られ、特に備蓄用として購入した際に希望する期限よりも短かったことが指摘されている。また、価格に関しても一部の購入者は近隣のスーパーよりも高いと感じており、明確な賞味期限の表示があれば良いという意見も存在する。商品自体の品質には満足しているものの、期待外れの点で納得がいかないユーザーもいる。',
  created_at: '2024-09-15 18:27:15.344438',
  updated_at: '2024-09-15 18:27:15.344438'
)

Analysis.create(
  product_id: 3,
  positive: 89,
  neutral: 7,
  negative: 4,
  summary: '多くの方から高評価を受けている麦茶について、特にラベルレスのデザインが非常に好評です。便利さや収納のしやすさ、飲みやすさが強調されており、あらゆる場面でリピート購入が増えています。一方、苦手な味に関するコメントもあり、約数点はその味に関する不満を述べている点が見受けられます。全体として、非常にポジティブな印象を与える商品であることがわかります。',
  sum_positive: 'ラベルレスの利便性が評価され、ゴミ捨てが楽だという意見が多く寄せられています。味に関しても多くの方が美味しいと感じていて、特に夏場に重宝するとの声が多いです。また、配送のスピードや定期的なリピートについても言及されており、全体的に満足度が高いです。家族や子供とのシェアを意識した購入者もおり、生活に役立つ商品として位置づけられています。',
  sum_negative: '一部の人が苦手な味を購入してしまい、満足度が低かったことが挙げられます。また、ラベルレスへの慣れに時間がかかるとの声もありおり、少数ながら不満を感じる声があることを示しています。全体的には好評ですが、個々の好みによって意見が分かれている瞬間もあるようです。普段使いされる製品だけに、味のバラつきがわずかに気になるという意見も寄せられています。',
  created_at: '2024-09-15 18:28:08.858474',
  updated_at: '2024-09-15 18:28:08.858474'
)

Analysis.create(
  product_id: 4,
  positive: 82,
  neutral: 12,
  negative: 6,
  summary: '多くのコメントが製品の便利さや品質を称賛しており、特にラベルレスデザインの利点が強調されている。リピーターも多く、特に夏場の需要に応えている様子が伺える。他方、若干の箱の状態の悪さや賞味期限に対する言及も見られ、全体としては高評価が目立つが若干の改善点も存在する。',
  sum_positive: '購入時の便利さやエコへの貢献が広く評価されており、特にラベルレスの利点が顕著。飲みやすさや風味の良さに関する意見が多く、コストパフォーマンスも高く評価されている。特にリピート購入をする顧客が多く、品質に満足している様子も見られる。',
  sum_negative: '一部のコメントでは、箱が空いている状態で届いたり、賞味期限が短かったりといった不具合が指摘されている。しかし、これらの意見は少数派であり、全体的に見れば多くの購入者が商品に対し高い満足度を持っているため、特に大きな問題点ではないと考えられる。',
  created_at: '2024-09-15 18:28:33.33518',
  updated_at: '2024-09-15 18:28:33.33518'
)

Analysis.create(
  product_id: 5,
  positive: 95,
  neutral: 4,
  negative: 1,
  summary: '多くの評価が非常に高く、特に暑い季節におけるポカリスエットの需要の高さが際立っている。迅速な発送や価格の手頃さが評価されており、家族や友人への贈り物としても利用されている様子が見ることができる。全体を通して、安定した品質と便利さが支持されている印象が強い。',
  sum_positive: 'タイムリーな配達や予防策としての利用が歓迎されている。特に、熱中症対策としての効果を重視する意見が多く、家族の健康を守るために頻繁に購入されていることが示されている。味や価格、発送の早さ、総合的な満足度から、非常に良い選択肢であるとの認識が広がっている。',
  sum_negative: 'ネガティブな意見はほとんどなく、一部のレビューでは価格に関する希望が挙げられている。特に、実店舗での価格と比較して少し高いと感じているものの、通常のニーズには応えられたとする意見が支配的である。全体的に不満よりも満足度が明らかに高い。',
  created_at: '2024-09-15 18:29:23.371944',
  updated_at: '2024-09-15 18:29:23.371944'
)

Analysis.create(
  product_id: 6,
  positive: 74,
  neutral: 18,
  negative: 8,
  summary: '多くの利用者がこの商品を購入し、主に価格や飲みやすさ、配達の速さに満足しています。一方で、商品の外装や品質に関する意見もあり、一部のユーザーは不満を持っています。全体的にはポジティブな感想が主流です。',
  sum_positive: '多くのコメントで、味や飲み心地の良さが高く評価されています。特に、ラベルレスで環境に配慮した点や、価格の手頃さが喜ばれており、リピート購入を考えるユーザーも多いです。また、非常時の備蓄用に購入する際にスムーズな配送が特に評価されています。',
  sum_negative: '悪評価の理由として、配送時の箱の状態や商品自体の異臭が目立っています。特に一部のユーザーが体験した匂いや品物の状態に対し、不快感を示しています。また、過去にも同様の問題があったとの指摘もあり、改善を求める声もあります。',
  created_at: '2024-09-15 18:30:42.956083',
  updated_at: '2024-09-15 18:30:42.956083'
)

Analysis.create(
  product_id: 7,
  positive: 65,
  neutral: 23,
  negative: 12,
  summary: 'レビューは、全体的に非常に好意的な評価を示しており、ほとんどの利用者が音質やノイズキャンセリングの効果に満足していることが伺えます。ただし、クリーニングや使い勝手に関して一部ユーザーからは不満の声もあり、製品に対する期待感や愛着が強い一方で、改善点への指摘も見受けられました。',
  sum_positive: '多くのユーザーが音質の素晴らしさに感動し、ノイズキャンセリングの効果を強調しています。軽量でコンパクトなデザインも好評価で、Bluetooth接続の迅速さも高く評価されています。また、エコであることを理解した上でのパッケージの質にも触れる声があり、全体的に満足度が高いことが印象的です。',
  sum_negative: 'いくつかのユーザーからはイヤホン本体の滑りやすさや収納ケースの質感について不満が寄せられています。特に、ノイズキャンセリング機能の切り替え時に不便さを感じたり、イヤピースのフィット感の不足に言及する声も存在しています。また、接続不良や音切れに関する問題も指摘され、さらなる改善が期待されています。',
  created_at: '2024-09-15 18:36:02.420422',
  updated_at: '2024-09-15 18:36:02.420422'
)

Analysis.create(
  product_id: 8,
  positive: 65,
  neutral: 20,
  negative: 15,
  summary: '多くの利用者が高評価であり、音質やノイズキャンセリング機能に関する満足の声が多く見られる。一部のレビューでは予期しない不具合や不満もあるものの、全体としては価格に見合った性能として肯定的な意見が主流である。使い勝手やデザインについても高評価で、初めてのワイヤレスイヤホンとして選ぶ人も多いようだ。',
  sum_positive: '音質の高さやノイズキャンセリング機能が絶賛されており、特にSONYというブランドの信頼性が強調されている。満足度の高い装着感や使い勝手についての意見も多く、快適な使用体験を報告する声が多い。迅速な配送や、アプリを通じた機能の充実度も好評で、音質を重視するユーザーにとっては魅力的な選択肢となっている。',
  sum_negative: '一部では商品が初期不良に遭遇したり、アプリの使い勝手に不満を持つ声があがっている。特に音質に対する期待に対して満足しきれない意見があり、他のモデルとの比較が行われることも。また、価格に対してもう少し効果を感じたかったという声もあるが、全体的な機能性やコストパフォーマンスには概ね好意的でありながらも、一定の不満は存在する。',
  created_at: '2024-09-15 18:37:02.948237',
  updated_at: '2024-09-15 18:37:02.948237'
)

Analysis.create(
  product_id: 9,
  positive: 85,
  neutral: 10,
  negative: 5,
  summary: '全体的に、商品は高評価を受け、多くのユーザーが満足していることがわかる。特に、装着感、音質、価格に対するコストパフォーマンスが好評で、迅速な配送や梱包についても良い評価が寄せられている。実際の使用経験においても、安定したBluetooth接続や周囲の音を聞きながらの使用が可能な点がプラスに評価されている。また、特に子供へのプレゼントとしても喜ばれている点が印象的である。',
  sum_positive: '高評価の意見が多数見受けられる。特に、耳にフィットしやすい装着感や音質の良さが強調されており、特にコストパフォーマンスに関しては非常に満足しているとの声が多い。発送も迅速で、商品の梱包状態も良好であるとの意見があり、特に初めてのワイヤレスイヤフォン購入者からの肯定的な反応も目立つ。子供へのプレゼントとしても、喜ばれる商品としての評価がされている。',
  sum_negative: '一部ではポイントバックについての情報が分かりにくいとの指摘もあるが、全体的にはネガティブな意見は少ない。失くした場合の心配もあり、商品の取り扱いに気を配る必要があるとの意見が存在する。とはいえ、全体的には良い体験が多く、使用感にも大きな不満は見られないため、もっと強い批判は少ない印象である。',
  created_at: '2024-09-15 18:37:23.47758',
  updated_at: '2024-09-15 18:37:23.47758'
)

Analysis.create(
  product_id: 10,
  positive: 51,
  neutral: 27,
  negative: 22,
  summary: '全体を通じ、多くの使用者が音質や装着感に満足しており、外音を聞きながら音楽を楽しめるという特徴が好評である。一方で、音漏れや装着の違和感に対する指摘も見受けられ、特に使用環境や個人差による評価が分かれる点が興味深い。また、安全に音楽を楽しむためのデザインである点が高く評価されている。',
  sum_positive: '高評価が多く見られ、特に音質の良さと装着感の快適さが強調されている。オープン型であるため、外音も心地良く取り入れられ、日常の使用に適しているとの意見が多い。デザインや使いやすさ、さらには価格に見合ったパフォーマンスも支持されており、満足度が高い。',
  sum_negative: '一部使用者からは音漏れが著しいとの声が上がっており、特に公共の場での使用が難しいとの意見が目立つ。また、装着感について個人差があり、耳の形によってはフィットしないことがあるとの指摘も見受けられる。このため、使い方や環境によって評価が変わる印象がある。',
  created_at: '2024-09-15 18:37:54.535673',
  updated_at: '2024-09-15 18:37:54.535673'
)

Analysis.create(
  product_id: 11,
  positive: 63.2,
  neutral: 25.7,
  negative: 11.1,
  summary: '多くの利用者が優れた音質、軽快な装着感、周囲の音を聞き取れる特性を称賛している。特に、オープンイヤータイプのデザインが日常使いに適しており、耳が痛くならない点が高く評価されている。一部のレビューでは、音質に対する期待との違いや防水機能の向上を望む意見もある。全体として、満足度は高く、多くの人がリピート購入を検討している様子がうかがえる。',
  sum_positive: 'ほとんどのコメントが優れた音質や軽快さ、装着感を称賛している。耳が痛くならないオープンイヤー型の利点が特に強調され、長時間の使用でも快適であるとの声が聞かれる。音のクリアさや周囲音を聞き取れる性能が日常生活や仕事においても役立っていると多くの人が感じている。アプリでの調整機能が便利だとの意見も目立つ。',
  sum_negative: '一部の意見では音質への満足度が期待には及ばないとの声や、防水機能が不十分と感じるユーザーもいる。また、左右の電池持ちにバラツキがあることや、マイク性能に不安を感じる場合も見受けられ、特に従来の骨伝導からの変更については慎重さが必要とのコメントもあった。装着感が優れている一方で、耳に引っかかりが悪い場合もあるようで全ユーザーに完璧にフィットするわけではない。',
  created_at: '2024-09-15 18:38:30.129503',
  updated_at: '2024-09-15 18:38:30.129503'
)

Analysis.create(
  product_id: 12,
  positive: 71,
  neutral: 23,
  negative: 6,
  summary: 'レビュー全体からは、購入者の音質やノイズキャンセリング性能に対する満足感が特に高く、快適な使用感が求められていることが伺える。多くの意見がSONY製品のブランドイメージを支持し、特に一度試したノイズキャンセリング機能がその期待に応えている様子が見受けられる。一方で、いくつかのユーザーはタッチ機能やデザインに関して改善の余地があると感じている。',
  sum_positive: '音質の良さやノイズキャンセリング機能に驚かされ、特にその快適性を強調する意見が多数を占めている。レビューでは、使用者が期待以上の性能を実感していることが述べられており、ほぼ全ての購入者がこの製品を高く評価している。快適な装着感や使いやすさ、さらにプレゼントや家庭での使用など広範な使用シーンに適応している点が評価されている。',
  sum_negative: 'とはいえ、一部のレビュアーはタッチ機能の反応が鈍かったり、外音取り込み機能やデザインに不満を示している。特に、ノイズキャンセリング機能は優れた性能を持つ一方で、風切り音が気になるという意見もあり、完璧とまでは言えないとする見解も存在する。ケースのゴミがつきやすい点も、評価を下げる要因として挙げられており、実用性の向上が望まれている。',
  created_at: '2024-09-15 18:38:43.934935',
  updated_at: '2024-09-15 18:38:43.934935'
)

Analysis.create(
  product_id: 13,
  positive: 66,
  neutral: 26,
  negative: 8,
  summary: '多くの購入者が商品に対して高い満足度を示しており、特に音質や装着感、周囲の音を同時に認識できる骨伝導の特性を評価しています。特に運動時の使用に関連した利便性に対する意見が多く、一部のユーザーは購入を通じて自分の生活の質が向上したと感じています。一方で、音質に関する指摘やサイズ感への言及もあり、商品に対して完全な満足が得られない場合もあるようです。',
  sum_positive: '多くの意見では、音質の良さや装着感の快適さが好評です。特に、自転車やランニングなどアクティブな用途での便利さや、周囲の音を聴きつつ音楽を楽しめる点が強調されています。また、デザインの良さや、防水機能への満足感もあり、特にミニサイズのフィット感が好まれています。購入後のポジティブな感想が多く、安心して使える製品とされています。',
  sum_negative: '一部の意見では、音質がプラシーボに感じられるなどの指摘があり、特に本格的な音楽鑑賞には向かないとしています。また、サイズ感に関する不満もあり、大小に関わる意見が見受けられます。周囲の音を拾う機能に関しても、交通音などに埋もれるといった問題の指摘もありました。購入者の中には、製品の特性上、音楽鑑賞専用には不十分と感じているケースがあるようです。',
  created_at: '2024-09-15 18:38:54.772786',
  updated_at: '2024-09-15 18:38:54.772786'
)

Analysis.create(
  product_id: 14,
  positive: 82,
  neutral: 16,
  negative: 2,
  summary: '全体的に見て、商品への評価は非常に高い。多くの利用者が使用感や音質の良さ、さらに長時間の使用に対する快適さを強調しており、特にビジネス用途での利便性が高く評価されている。迅速なサポートにも満足感が感じられる。改善点は少なく、ほとんどのフィードバックがポジティブな印象を与えている。',
  sum_positive: '非常に良いと評価されている部分が目立ち、使用している環境や条件でも高評価を得ている。特に軽さや音質、バッテリーの持ちに満足しており、長時間使用しても不快感が少ないことが強調されている。便利な機能と使いやすさが多くの利用者にとって重要なポイントとなっている。',
  sum_negative: '評価の低い意見はほとんどなく、主にマイナーな不満が見受けられる。特に明確な問題点は挙げられておらず、全体的には強い満足感が感じられるが、細かい点での不安や要望が散見される。価格に対する躊躇いは見られるものの、性能に対する満足度が高く、結果的に良い選択として評価されている。',
  created_at: '2024-09-15 18:39:03.98767',
  updated_at: '2024-09-15 18:39:03.98767'
)

Analysis.create(
  product_id: 15,
  positive: 74,
  neutral: 14,
  negative: 12,
  summary: '全体的に高評価の商品が多く、特に音質やノイズキャンセリング機能に満足しているユーザーが目立つ。配送や梱包の迅速さや丁寧さについても評価が高い。少しの価格差を気にする声もあるが、信頼できるショップでの購入を選ぶ傾向にある。全体的に、使用者の生活の質を向上させる商品として認識されている。',
  sum_positive: '多くの方が音質やノイズキャンセリング性能に非常に満足しており、特に移動時のストレスを軽減する上での効果を評価している。使用感や付け心地の良さにも言及され、高価格ながらもこれらの性能に納得している様子が伺える。家庭用や外出用に使い分けているユーザーも多く、機能性が高いことが評価されている。',
  sum_negative: '中には音質にこだわりを持つ方が存在し、他のメーカーと比べて劣っていると感じる意見がある。特に、ヘッドホンのデザインや装着感について不満を抱えているユーザーもおり、特に長時間使用時に痛みを感じる場合がある。期待を裏切らない商品である反面、すべてのニーズに応え切れていないとの意見もある。',
  created_at: '2024-09-15 18:39:27.593727',
  updated_at: '2024-09-15 18:39:27.593727'
)

Analysis.create(
  product_id: 16,
  positive: 49,
  neutral: 27,
  negative: 24,
  summary: 'レビュー全体を通じて、マウスのデザインや静音性、使い勝手の良さが好評である一方、一部では故障や品質に関する心配が示されています。多くの利用者が静音設計に満足しており、特に深夜の使用時に音を気にせず使える点が評価されています。サイズ感や見た目も多くの人に受け入れられ、手にフィットして快適さを提供していると感じられていますが、長期間使用した結果、反応が悪くなる問題も指摘されています。',
  sum_positive: '高評価の意見では、特に小型で静音のデザインが称賛されており、小さな手にもぴったりフィットする点が強調されています。また、嬉しい価格設定と簡単なセットアップが多くの購入者にとっての魅力であり、実際に使用した結果、軽快な操作感が気に入られています。様々なカラーやデザインも高評価を得ており、購入者が長期間にわたって使用したいと感じる商品として評価されています。',
  sum_negative: '一方で、低評価の意見では、数か月後に発生する故障や反応の悪化が問題視されています。静音設計は評価されつつも、別の上位モデルと比較するとやや音が気になるとの声も見受けられ、個々の使用感に差があることが示されています。また、サイズに関する不満として、もう少し大きいサイズのニーズが示されています。全体的に、良い点が多い製品ながらも、品質に関する懸念も少なからず存在しています。',
  created_at: '2024-09-15 18:42:57.320094',
  updated_at: '2024-09-15 18:42:57.320094'
)

Analysis.create(
  product_id: 17,
  positive: 72.5,
  neutral: 22.5,
  negative: 5,
  summary: '商品は全体的に高い評価を受けており、ほとんどのユーザーが使いやすさやコストパフォーマンスの良さを称賛しています。特に、接続が簡単で、動作がスムーズであることが広く評価されており、デザインやカラーにも満足度が高いようです。一方で、一部のユーザーからは低耐久性や誤動作についての不満も見られますが、多数派とは言えない意見です。機能面においてもシンプルさを求める声があり、特別な機能よりも安定性が重視されています。',
  sum_positive: '多くのユーザーが商品の使いやすさやデザインに満足しており、特にクリック感や動作の滑らかさについて好意的に述べています。また、手に馴染むサイズや軽量さ、コスパの良さも高く評価されています。迅速な配送や丁寧な包装に感謝する声も多く、総じて安心して使える商品として支持されています。ロジクールの製品品質に信頼を寄せる意見が多数見受けられ、リピート購入を検討しているユーザーも存在します。',
  sum_negative: '数少ない否定的な意見としては、耐久性不足や誤動作に関する不満が挙げられます。特に、購入後短期間で故障したり、ダブルクリックの不具合が発生したという声があり、これが利用者のストレスの原因となっています。また、クリック音が気になるという意見もあり、次回は別の静音モデルを検討したいというユーザーもいます。総じて、耐久性に関しては改善の余地があると感じる意見が散見されます。',
  created_at: '2024-09-15 18:44:44.041759',
  updated_at: '2024-09-15 18:44:44.041759'
)

Analysis.create(
  product_id: 18,
  positive: 64,
  neutral: 25,
  negative: 11,
  summary: '多くの使用者がこの製品に満足しており、特に快適さや作業効率の向上が際立っています。無線接続による利便性やトラックボールのデザインが評価されている一方、耐久性やデザイン面での不満も散見されます。そのため、全体的な評価は高いものの、一部には改善を求める声もあります。',
  sum_positive: '使用することで得られる快適さや操作性に非常に高い評価が寄せられています。特に手首の負担が軽減される点や、トラックボールによる精度の高い操作に好意的な意見が目立ちます。長時間の使用でも疲れにくく、仕事での生産性向上に寄与しているとの声も多く、リピーターも存在するようです。',
  sum_negative: 'デザインや耐久性に対する不安の声が一部から上がっています。特に表面素材の劣化やボタン配置に対する不満が目立ちます。使用中に不具合が生じることや、慣れが必要である点にも注意が必要との意見もあり、低評価を付けた利用者はこれらを問題視しています。',
  created_at: '2024-09-15 18:45:39.54785',
  updated_at: '2024-09-15 18:45:39.54785'
)

Analysis.create(
  product_id: 19,
  positive: 65,
  neutral: 20,
  negative: 15,
  summary: '多くの人がこの製品に関して高評価を持っており、特に静音性やデザイン、軽さについての意見が多い。使用感や価格に満足しているとの声も多く、リピート購入するユーザーが多数存在する。中には、使用中の寿命や光らないライトについての懸念を示す人もいるものの、全体としてはポジティブな印象が強い。',
  sum_positive: '魅力的なデザインと静かな動作が高く評価されており、多くのユーザーが使いやすさや軽さに満足している。特に、価格に対する品質の高さを褒める意見が多数見受けられ、リピーターも多い。可愛らしいカラーリングやシンプルな機能性が気に入られており、周囲にも勧めたくなる商品として支持されている。',
  sum_negative: '一部のユーザーからは、クリックが反応しにくくなることや寿命についての懸念が表明されている。新品の状態では問題ないが、長期間の使用後に不具合が見られることがあり、その点が不満として挙げられた。また、ライトが点灯しないことに疑問を持つ意見もあり、製品によっては気になる点が存在することが示唆されている。',
  created_at: '2024-09-15 18:48:36.238786',
  updated_at: '2024-09-15 18:48:36.238786'
)

Analysis.create(
  product_id: 20,
  positive: 64,
  neutral: 25,
  negative: 11,
  summary: '多くの意見が本製品の使いやすさや静音性に対して高い評価を与えています。特に静音性は好評で、在宅勤務や静かな場所での利用に適しているとされています。また、デザインやコストパフォーマンスにも満足している声が見受けられ、一部利用者からは過去の製品と比較して満足度が高まったと報告されています。ただし、いくつかの意見では機能面での不満も表明されており、特に一部ボタンの静音性やカスタマイズに関する要望が上がっています。',
  sum_positive: '使用者からは高い評価が寄せられ、特に静音性や快適さ、デザインの良さが際立っています。また、接続が簡単で、操作性の滑らかさが praised されています。多様な機能があり、特にクリック音が静かである点が利用者の支持を得ており、他の製品からの買い替えで良い選択だったという感想も多く見られます。全体として、仕事やプライベートの両方で使いやすく、リピート購入を考えている方も多いです。',
  sum_negative: '一部の意見では、特定機能の欠如に対する失望感が強調されている。特に、サイドボタンの静音性がないことや、一部アプリケーションの扱いに混乱があることが問題視されています。また、使用する際に感じる不便さや、機能が思いのほか減少している点に対して残念な声も上がっています。全体としては、期待に対する不一致感が表れており、他の製品との比較で不満が発生するケースが目立ちます。',
  created_at: '2024-09-15 18:48:54.212473',
  updated_at: '2024-09-15 18:48:54.212473'
)

Analysis.create(
  product_id: 21,
  positive: 78,
  neutral: 17,
  negative: 5,
  summary: '多くのレビューがこの製品の性能や使いやすさを称賛しており、特にマウスの操作性や滑りの良さが高く評価されています。また、素材やデザインも好評です。一方で、サイズ感についての意見もあり、さらに価格に対する指摘も存在しますが、全体的には高い満足度が示されました。',
  sum_positive: '多数の意見で、マウスの滑りがスムーズで快適に使える点が強調されており、特にロジクールの製品との相性が良いことが言及されています。デザインや素材の質感も評価されており、特に撥水性が功を奏した具体例もあります。使い心地の良さからリピート購入の意図を示すコメントも見受けられます。',
  sum_negative: 'いくつかの意見ではサイズが予想より大きかったり小さかったりといった感想があり、もう少し小さなサイズが望ましいとの声がありました。また、価格に対してのコメントも存在し、もう少し安価であれば満足度が高まるのではないかという意見がありました。全体としては少数ですが、改善点を挙げているものもありました。',
  created_at: '2024-09-15 18:49:10.272606',
  updated_at: '2024-09-15 18:49:10.272606'
)

Analysis.create(
  product_id: 22,
  positive: 80,
  neutral: 15,
  negative: 5,
  summary: '全体的に、高評価が目立ち、特にコストパフォーマンスや使いやすさに対する満足度が高い。多くの利用者が扱いやすさ、反応の良さ、価格の安さを挙げており、リピート購入や他者への推奨も多く見受けられる。配送の速さや丁寧な梱包についても評価されている。しかし、一部使用体験については微細な問題が指摘されている。',
  sum_positive: '価格に対する優れた性能が高く評価されており、多くのユーザーが使いやすさや軽量性についての喜びを語っている。また、迅速な対応と配送の速さについても好評で、全体の満足度を向上させている。特に、コストパフォーマンスの良さがリピート購入の理由として挙げられている点が強調される。',
  sum_negative: '一部のユーザーからはホイールの初期不良や握りやすさについての懸念が示されている。ただし、全体としては小さな問題であり、使用中に解消されることもある様子。また、一部のレビューでは耐久性への期待について触れられ、今後の持続性に懸念が示された部分がある。',
  created_at: '2024-09-15 18:49:28.048838',
  updated_at: '2024-09-15 18:49:28.048838'
)

Analysis.create(
  product_id: 23,
  positive: 65,
  neutral: 30,
  negative: 5,
  summary: '全体として、高性能で使いやすいデバイスとして非常に高い評価を受けている。一部の購入者は高価格を懸念しつつも、価格以上の価値を見出しており、動作音の静音性、クリック感や機能性を特に評価している。しかし、一方で特定の機能が期待に応えられないとのレビューもあり、概ね満足度は高いが、個々の用途によって賛否が分かれる側面もある。',
  sum_positive: '高い性能と多機能性が好評であり、特に静音性やカスタマイズ性が賞賛されている。手にしっくりとくるフィット感や使い勝手、ボタン配置の便利さが多くの購入者にとって満足度をさらに高めている。多くのユーザーが他のマウスと比較し、圧倒的な違いを実感しており、特に仕事効率向上に寄与しているとの意見が多い。',
  sum_negative: '一部では高価格に対するコストパフォーマンスに疑問を呈する意見が見受けられ、特定の機能に対し不満を抱く声もある。特に、特定の用途において十分に機能しないと感じる人がいるほか、使用上の説明書が不十分と感じるユーザーも。価格に見合うだけの満足感を得られないとする意見も散見され、全体として満足度には個人差が存在している。',
  created_at: '2024-09-15 18:50:02.101743',
  updated_at: '2024-09-15 18:50:02.101743'
)

Analysis.create(
  product_id: 24,
  positive: 70,
  neutral: 20,
  negative: 10,
  summary: '多くの利用者がこの商品に非常に満足しており、特に使い勝手やデザインについての高評価が目立つ。特に子供用として購入するケースが多く、ゲームやPC操作において快適さが評価されている。逆に、充電ケーブルに関しての不満や、設定時の初期値の問題など、若干の不安を訴える声も散見される。',
  sum_positive: '使いやすさや快適さを強調する意見が多く、特に子供たちが喜んで使用している様子が感じられる。製品のデザインが良好であることや、無線でも快適に使用できる点が大いに評価されている。また、説明書がわかりやすいとの声もあり、購入者の期待に応える商品であることが伝わる。',
  sum_negative: '主に充電ケーブルの仕様や初期設定に関する不満が挙げられ、特に一般的なtypeCではなくmicroUSBであることが不便とされている。また、初期値が設定されていることが不便であると感じるユーザーもおり、スムーズに使用するための工夫が必要との意見が寄せられている。このような声が一部の利用者の満足度を下げていることがわかる。',
  created_at: '2024-09-15 18:51:07.627206',
  updated_at: '2024-09-15 18:51:07.627206'
)

Analysis.create(
  product_id: 25,
  positive: 68,
  neutral: 20,
  negative: 12,
  summary: '軽さや使いやすさが高く評価されており、特にゲーム用途での満足度が高い状況です。一方で、耐久性についての不満も見受けられ、特に壊れやすいとの意見がありました。使い心地は統一して良い評価を得ており、全体として非常にポジティブな印象がありますが、一部には改善点を求める声も存在しています。',
  sum_positive: '多くの意見で軽量性や操作性の良さが称賛されており、特にゲーミングにおいてのパフォーマンス向上を実感している声が多いです。また、バッテリー持ちやデザインについても好評で、多くのユーザーが満足度を報告しているため、リピート購入も見受けられます。',
  sum_negative: '壊れやすさが問題視されている意見が目立ち、特に軽量マウスが耐久性に乏しいという不満があります。一部のレビューでサイズ感や設計に対する細かな指摘があり、特に小さな手の持ち主にはフィット感が欠ける場合があるとの意見もあります。また、価格に対するコストパフォーマンスについても疑問を持つ声があり、値段が高いとの指摘が見られます。',
  created_at: '2024-09-15 18:51:19.056367',
  updated_at: '2024-09-15 18:51:19.056367'
)

Analysis.create(
  product_id: 26,
  positive: 80,
  neutral: 20,
  negative: 0,
  summary: '全体的に高い評価が寄せられており、特に使用者の満足度が高いことが伺える。音の強さやライティング機能に対するポジティブな意見が目立ち、使用感や喜びを感じているユーザーが多い。一方で、青軸の音に対する懸念も見受けられ、特定の環境での使用に注意が必要との意見もある。',
  sum_positive: '音と押しごたえがある青軸が子供に好評で、特に喜びの声が多く聞かれる。光る機能にも満足しているユーザーが多く、見た目の効果も評価されている。全体的に使用体験にポジティブな影響を与える要素が揃っている。',
  sum_negative: '音が大きいというデメリットについての意見があり、静かな環境では不向きであると指摘されている。使用状況によっては不安を感じるユーザーもおり、特に騒音を気にする方にとっては不向きであるとの警告がある。',
  created_at: '2024-09-15 18:51:56.520309',
  updated_at: '2024-09-15 18:51:56.520309'
)

Analysis.create(
  product_id: 27,
  positive: 76,
  neutral: 12,
  negative: 12,
  summary: '多くの人がゲームや日常的な使用において高い満足度を示しており、デザイン性や使いやすさが特に評価されています。特に子ども向けの製品としての有用性が強調されている一方、少数の意見では配送時の梱包やタイプ感についての不満も見受けられます。全体として非常にポジティブな印象が強いです。',
  sum_positive: '多くの意見では、デザインのスマートさや使い心地の滑らかさが称賛されており、特にゲーム向けとしての性能が高く評価されています。子どもたちが喜ぶ様子や、ゲームプレイによるスキル向上など、実用面での利益が明確になっています。全体的に満足度が高い印象を持たれていることが分かります。',
  sum_negative: '一部の意見では、配送時の梱包に不安があり、精密機器として適切な保護がされていなかったとの指摘がありました。また、途中でタイピングのしにくさや、使用感についての改善点が挙げられていますが、これらはゲーム用としては許容範囲内との意見も見られ、全体としての評価には大きな影響を与えていないようです。',
  created_at: '2024-09-15 18:52:04.875259',
  updated_at: '2024-09-15 18:52:04.875259'
)

Analysis.create(
  product_id: 28,
  positive: 73,
  neutral: 18,
  negative: 9,
  summary: '全体として、製品はユーザーに非常に良い印象を与えています。多くのレビューでは、打鍵感やデザインの良さ、使いやすさが高く評価されています。特に静音性や機能性が強調され、コストパフォーマンスの良さも、購入したユーザーの満足度を高めています。一方で、実物を見ずに購入したことによる後悔を示す声もあり、価格や耐久性についての懸念も存在します。',
  sum_positive: '多数の意見が、使いやすさや打鍵感の快適さを強調しています。特に、音が静かである点や、キーボードの光る機能が使いやすいと好評です。デザインが派手でなく、使いやすさを重視した設計に満足しているコメントが多く寄せられています。また、コストパフォーマンスの良さや、購入から到着までのスピードも評価されています。',
  sum_negative: 'いくつかの意見では、実物を確認せずに購入した結果、期待外れの部分があったとの指摘が見られます。特にキータッチに関する不満や、日本語記号が表示されていない点についての後悔が挙げられています。耐久性と寿命についても懸念があり、長く使えるかが疑問視されています。全体として、実際に手に取って確認することの重要性が訴えられています。',
  created_at: '2024-09-15 18:52:27.020108',
  updated_at: '2024-09-15 18:52:27.020108'
)

Analysis.create(
  product_id: 29,
  positive: 86.5,
  neutral: 9.5,
  negative: 4,
  summary: '多くのレビューから、特に打鍵感や快適さに対する満足度が非常に高いことが明らかになっている。多くの人がこの製品を他のキーボードと比較した場合に、使いやすさやデザイン性についても評価しており、購入後の後悔は少ない。代わりに、特殊な配列に対する戸惑いがあったものの時間が経つにつれて慣れる様子が示されている。一方で、いくつかの機能に関する不満もみられ、それが全体の印象にも影響している。',
  sum_positive: 'タイピングの快適さや打鍵感についての評価が非常に高く、特に仕事での使用や長時間のタイプに際してその良さを実感しているという意見が多い。また、デザイン性や持ち運びのしやすさについても肯定的な意見が多く、別のキーボードには戻れないという強い感情を持っているレビューも多い。さらに、キーボードのカスタマイズが楽しいと感じているユーザーも存在する。',
  sum_negative: '特殊なキー配列に戸惑う声が見受けられ、これに慣れるまでの苦労を述べるレビューがある。また、一部では価格に対する懸念が示されており、特定の機能において不満を持つユーザーもいる。たとえば、Bluetooth接続に関する問題や、耐久性に疑念を抱く意見がある。これらのネガティブな印象が、全体の評価に微妙な影を落としていることも理解できる。',
  created_at: '2024-09-15 18:53:14.337554',
  updated_at: '2024-09-15 18:53:14.337554'
)

Analysis.create(
  product_id: 30,
  positive: 58,
  neutral: 29,
  negative: 13,
  summary: '全体として、この商品は高い満足度を持つキーボードとして評価されています。特にタイピング感覚や静音性についての意見が多く寄せられており、使用者は製品の性能に感動しています。しかし、一部のユーザーはBluetooth接続の不具合や重量、エコモードに関する不満を持っており、少しの改善が望まれています。',
  sum_positive: '非常に快適な打鍵感と静音性が高く評価されています。多くの人が他のキーボードには戻れないとの感想を持ち、製品のデザインや操作感も好評です。Bluetooth接続のスムーズさや、耐久性にも満足している声が多数見られ、高級感が体感できるという意見が多いです。',
  sum_negative: 'ワイヤレス接続の安定性やチャタリング、操作音に関する不満が目立ちます。一部のユーザーからは、重さや電源が切れてしまう頻度についても指摘されており、特にBluetooth接続の問題がストレスとして挙げられています。説明書の分かりにくさに対する意見も見受けられ、ユーザー体験の向上が求められています。',
  created_at: '2024-09-15 18:53:23.736233',
  updated_at: '2024-09-15 18:53:23.736233'
)

Analysis.create(
  product_id: 31,
  positive: 94,
  neutral: 6,
  negative: 0,
  summary: 'この製品は多くのユーザーに非常に高く評価されており、特にタイピングの快適さや静音性が際立っている。職場や自宅での使用において、入力時の疲労感が減少し、作業効率の向上が実感されている。また、デザインや手触りも好評で、使い始めてから他の選択肢へ戻れなくなるとの声も多い。全体的に、値段に見合った価値があると考えられている。',
  sum_positive: '多くのコメントがキーボードの打鍵感や反応速度、静音性についての満足度を表現している。特に長時間のタイピングでも疲れにくく、仕事の効率を向上させるとの意見が目立つ。加えて、デザインや使いやすさからも高評価を得ており、購入を推奨する意見が多く見られる。高級キーボードとしての質の高さが確認されている。',
  sum_negative: 'ネガティブな意見はあまり見受けられなかったが、少数のレビューでは細かい不満点が指摘されている。例えば、ファンクションキーの配置やUSBケーブルの扱いやすさについてのコメントがあった。また、梱包の不備があり、受け取った際に外装箱が潰れていたことを気にする声も。全体的には良好な体験が多く、わずかな改善点が示唆されている。',
  created_at: '2024-09-15 18:53:33.330743',
  updated_at: '2024-09-15 18:53:33.330743'
)
