Review.create(
  user_id: '1',
  product_id: '31',
  description: 'キーストロークが深すぎてスペーサー２mmを追加購入せざるを得なかったし取り付けるのもめんどくさかった。静音性や打鍵感が向上したが、そもそも最初から2mmスペーサーを取り付けた状態で売ってほしい。BackSpaceキーの幅はEnterキーと同じ幅ぐらいあった方がいい。隣の￥キーと幅が一緒なので間違って押してしまうことがある。',
  rating: '3',
  bought_date: '2024-09-15 18:26:00.000000'
)

Review.create(
  user_id: '2',
  product_id: '31',
  description: 'どんなもんか買ってみたら、重厚感があってタイピングし易いです。やはり値段はものを言いますね。',
  rating: '4',
  bought_date: '2024-09-16 11:26:00.000000'
)

Review.create(
  user_id: '3',
  product_id: '31',
  description: 'あまり気にせず標準キーボードを使っていましたが、久々に長文を打つと指が疲れるのに気付きました。最初はメカニカルキーボードでもいいかなと思っていたんですが、もう1万円出せばこちらが購入できるとわかり試し打ちもなしに思い切って購入しました。
結果とてもよかったです！',
  rating: '5',
  bought_date: '2024-09-17 23:26:00.000000'
)
